Revit 2016 API
GlobalParameter.CanLabelDimension Method
 Tests whether a dimension can be labeled by the global parameter.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 16.0.0.0 (16.0.0.0)
Since: 2016 Subscription Update
Syntax
C#
public bool CanLabelDimension(
	ElementId dimensionId
)
Visual Basic
Public Function CanLabelDimension ( _
	dimensionId As ElementId _
) As Boolean
Visual C++
public:
bool CanLabelDimension(
	ElementId^ dimensionId
)
Parameters
dimensionId
Type: Autodesk.Revit.DB.ElementId
 Id of a dimension element.
Return Value
 True of the input dimension can be labeled by this global parameter; False oterwise.
Remarks
 Possible causes include a dimension that cannot be labeled at all, or it is of other than Linear or Angular type, or does not have the appropriate labeling parameter. Other reason for this method returning False is that the data type of this global parameter is not suitable for labeling (i.e. it contains neither Length nor Angle value).
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was NULL
See Also
GlobalParameter Class
Autodesk.Revit.DB Namespace